## Pandas :

In [2]:
### Installing the library:

In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\niharikaa\anaconda3\lib\site-packages (0.24.2)
Requirement already satisfied: numpy>=1.12.0 in c:\users\niharikaa\anaconda3\lib\site-packages (from pandas) (1.16.2)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\niharikaa\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: pytz>=2011k in c:\users\niharikaa\anaconda3\lib\site-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in c:\users\niharikaa\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
### importing pandas library:

import pandas as pd

## Series:

* the data will be in 1-d .
* The output of this series will be row by row(line by line).

In [5]:
### creating the data using series:

a = pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
### creating data using numpy in series:

import numpy as np
a = pd.Series(np.array([1,2,3,4]))
a

0    1
1    2
2    3
3    4
dtype: int32

In [10]:
#### creating series using tuple:

a = pd.Series((1,2,3,4))
a

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
### creating series using dictionary:

d = {'a' : 1,'b':2,'c':3}
d

{'a': 1, 'b': 2, 'c': 3}

In [12]:
a = pd.Series(d)
a

a    1
b    2
c    3
dtype: int64

In [13]:
a = pd.Series({'a' : 1,'b':2,'c':3})
a

a    1
b    2
c    3
dtype: int64

In [14]:
## changing the default index to defined index:

a = pd.Series([1,2,3,4],index = ['p','y','t','h'])
a

p    1
y    2
t    3
h    4
dtype: int64

In [21]:
b = [1,2,3,5,6,7,8,8,'a']
a = pd.Series(b,index = np.arange(len(b)))
a

0    1
1    2
2    3
3    5
4    6
5    7
6    8
7    8
8    a
dtype: object

In [22]:
### checking the datatype of series elements:

a.dtype

dtype('O')

## Data Frame:

In [25]:
a = pd.DataFrame([1,2,3,4])
a

   0
0  1
1  2
2  3
3  4

In [28]:
### creating mutliple columns:

a = pd.DataFrame([["Niharikaa",30,20,40],["Mounica",30,26,39],["Lavanya",10,40,50]])
a

           0   1   2   3
0  Niharikaa  30  20  40
1    Mounica  30  26  39
2    Lavanya  10  40  50

In [31]:
a = pd.DataFrame([["Niharikaa",30,20,40],["Mounica",30,26,39],["Lavanya",10,40,50]],columns = ["Name","English","Python","C"],index = [1,2,3])
a

        Name  English  Python   C
1  Niharikaa       30      20  40
2    Mounica       30      26  39
3    Lavanya       10      40  50

In [32]:
### Creating the DataFrame using dictionary:

d = {"Name" : ["Niharikaa","Mounica","Lavanya"],
    "Branch" : ["Ece","Cse","Ece"],
    "Year" : [2018,2019,2018]}
d

{'Name': ['Niharikaa', 'Mounica', 'Lavanya'],
 'Branch': ['Ece', 'Cse', 'Ece'],
 'Year': [2018, 2019, 2018]}

In [33]:
a = pd.DataFrame(d,index = [1,2,3])

In [34]:
a

        Name Branch  Year
1  Niharikaa    Ece  2018
2    Mounica    Cse  2019
3    Lavanya    Ece  2018

In [43]:
### Creating dataframe using multiple Dictinaries:

data = [{'a':1,"b":2,'c':3},{'a':3,'c':4}]
a = pd.DataFrame(data)
a

   a    b  c
0  1  2.0  3
1  3  NaN  4

In [55]:
### converting series into data frame:

d = {"one" : pd.Series([1,2,3],index = [1,2,3]),
    "Two" : pd.Series([4,5,7],index = [1,2,3])}
a = pd.DataFrame(d)
a

   one  Two
1    1    4
2    2    5
3    3    7

In [56]:
d = {"one" : pd.Series([1,2,3],index = [1,2,3]),
    "Two" : pd.Series([4,5,7])}
a = pd.DataFrame(d)
a

   one  Two
0  NaN  4.0
1  1.0  5.0
2  2.0  7.0
3  3.0  NaN

In [58]:
a = [1,2,3,5]
a = pd.DataFrame(a,dtype = "float64")
a

     0
0  1.0
1  2.0
2  3.0
3  5.0

In [76]:
a = pd.DataFrame([["Niharikaa",30,20,40],["Mounica",30,26,39],["Lavanya",10,40,50]],columns = ["Name","English","Python","C"],index = [1,2,3])
a

        Name  English  Python   C
1  Niharikaa       30      20  40
2    Mounica       30      26  39
3    Lavanya       10      40  50

### Accessing the data :

In [60]:
a.values  ### getting the entre values of the dataframe.

array([['Niharikaa', 30, 20, 40],
       ['Mounica', 30, 26, 39],
       ['Lavanya', 10, 40, 50]], dtype=object)

In [61]:
a.index

Int64Index([1, 2, 3], dtype='int64')

In [73]:
a=pd.DataFrame([[1,2,3,4,6],[5,6,7,8,None]],columns=['First Language', 'Second Language', 'Third Langauge', 'Mathematics','Science'],index=['17125A0301','17125A0302'])
a

,First Language,Second Language,Third Langauge,Mathematics,Science
17125A0301,1,2,3,4,6.0
17125A0302,5,6,7,8,NaN

In [74]:
a.isnull()  ### checking null values

,First Language,Second Language,Third Langauge,Mathematics,Science
17125A0301,False,False,False,False,False
17125A0302,False,False,False,False,True

In [75]:
a.notnull() ## checking not null values

,First Language,Second Language,Third Langauge,Mathematics,Science
17125A0301,True,True,True,True,True
17125A0302,True,True,True,True,False

In [77]:
a

        Name  English  Python   C
1  Niharikaa       30      20  40
2    Mounica       30      26  39
3    Lavanya       10      40  50

In [78]:
a["Name"]

1    Niharikaa
2      Mounica
3      Lavanya
Name: Name, dtype: object

In [79]:
a["Name"][2]

'Mounica'

In [82]:
a[:2] ### first two rows

        Name  English  Python   C
1  Niharikaa       30      20  40
2    Mounica       30      26  39

In [84]:
a[-1:]   ### last row

      Name  English  Python   C
3  Lavanya       10      40  50

In [86]:
a.head()   ### first five rows

        Name  English  Python   C
1  Niharikaa       30      20  40
2    Mounica       30      26  39
3    Lavanya       10      40  50

In [87]:
a.head(10)   ### first 10 rows

        Name  English  Python   C
1  Niharikaa       30      20  40
2    Mounica       30      26  39
3    Lavanya       10      40  50

In [88]:
a.tail()   ### last 5 rows

        Name  English  Python   C
1  Niharikaa       30      20  40
2    Mounica       30      26  39
3    Lavanya       10      40  50

In [89]:
a.tail(10)    ### last 10 rows

        Name  English  Python   C
1  Niharikaa       30      20  40
2    Mounica       30      26  39
3    Lavanya       10      40  50

### iloc and loc :

* iloc : for accessing the rows using the default index datatype integer.
* loc : for accessing the rows using the defined index datatype.

In [90]:
a.iloc[1]   ### default index accessing

Name       Mounica
English         30
Python          26
C               39
Name: 2, dtype: object

In [92]:
a.loc[1]    ### userdefined index accessing.

Name       Niharikaa
English           30
Python            20
C                 40
Name: 1, dtype: object